Tekla Open API Reference for Tekla Structures 2025
SpiralBeam.TotalRise Property
 Gets or sets the difference between the spiral beam start and end point in the direction of the rotation axis.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double TotalRise { get; set; }
Public Property TotalRise As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SpiralBeam Class
Tekla.Structures.Model Namespace